using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace LearnIT
{
    public partial class FormAbout : Form
    {
        #region оптимизация отображения всего

        protected override CreateParams CreateParams
        {
            get
            {
                CreateParams cp = base.CreateParams;
                cp.ExStyle |= 0x02000000;  // Turn on WS_EX_COMPOSITED
                return cp;
            }
        }

        #endregion оптимизация отображения всего

        public FormAbout()
        {
            InitializeComponent();
            DoubleBuffered = true;
            textBox1.Text = "\t\tFAQ\r\nЯкщо вибрати вже існуючу назву бази - вона перезапишеться." +
               "\r\nНазва бази МАЄ бути вказана для розблокування кнопок збереження і завантаження." +
               "\r\nЗберігати бази треба в теці UserPacks. З інших місць вантажити не буде." +
               "\r\nБаза автоматично зберегтися в пам'ять програми після закриття програми або переходу з налаштувань на іншу вкладку." +
               "\r\nЩоб створити нову базу треба зберегти її з новим ім'ям." +
               "\r\nРекомендується редагувати файли тільки за допомогою LearnIT. Інакше можуть і виникатимуть помилки." +
               "\r\nПравильних відповідей може бути більше одного, але зараховуватися в грі вони будуть все-рівно як один." +
               "\r\nПоки ви не натиснули кнопку зберегти - усі зміни остануться в програмі але не у файлі." +
               "\r\nМожна не вказувати усі 4 варіанти відповіді, але як мінімум один" +
               "\r\nГарячі клавіші = f1 - ГРА, f2 НАЛАШТУВАННЯ, f3 ПРО ПРОГРАМУ, f4 додому. У грі шорткаты = 1 лівий верхній варіант" +
               "2 правий верхній, q лівий нижній варіант, w правий нижній варіант, запустити гру enter, наступне питання space" +
               "\r\nГра закінчитися по витіканню часу або якщо усі питання закінчаться" +
               "\r\n" +
               "\r\nЯк грати - На вкладці налаштування вибрати або створити пак питань, перейти у вкладку гра і грати." +
               "\r\nЯкщо грати не залогінившись те результати записуватися не будуть" +
               "\r\n" +
               "\r\n" +
               "\r\n" +
               "\r\n" +
               "\r\n" +
               "\r\n";
        }
    }
}